sysbench/yusp/bak/master.log
sysbench 1.0.9 (using system LuaJIT 2.0.4)

Running the test with following options:
Number of threads: 512
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 512 tps: 51517.19 qps: 51517.19 (r/w/o: 51517.19/0.00/0.00) lat (ms,95%): 31.37 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 512 tps: 53413.99 qps: 53413.99 (r/w/o: 53413.99/0.00/0.00) lat (ms,95%): 29.72 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 512 tps: 53175.11 qps: 53175.11 (r/w/o: 53175.11/0.00/0.00) lat (ms,95%): 30.26 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 512 tps: 53815.44 qps: 53815.44 (r/w/o: 53815.44/0.00/0.00) lat (ms,95%): 29.72 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 512 tps: 52242.04 qps: 52242.04 (r/w/o: 52242.04/0.00/0.00) lat (ms,95%): 30.81 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 512 tps: 53820.42 qps: 53820.42 (r/w/o: 53820.42/0.00/0.00) lat (ms,95%): 30.81 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 512 tps: 53660.66 qps: 53660.66 (r/w/o: 53660.66/0.00/0.00) lat (ms,95%): 29.19 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 512 tps: 53595.50 qps: 53595.50 (r/w/o: 53595.50/0.00/0.00) lat (ms,95%): 30.26 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 512 tps: 53005.03 qps: 53005.03 (r/w/o: 53005.03/0.00/0.00) lat (ms,95%): 30.26 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 512 tps: 53788.03 qps: 53788.03 (r/w/o: 53788.03/0.00/0.00) lat (ms,95%): 29.72 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 512 tps: 54651.17 qps: 54651.17 (r/w/o: 54651.17/0.00/0.00) lat (ms,95%): 29.19 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 512 tps: 54231.08 qps: 54231.08 (r/w/o: 54231.08/0.00/0.00) lat (ms,95%): 29.72 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 512 tps: 53634.41 qps: 53634.41 (r/w/o: 53634.41/0.00/0.00) lat (ms,95%): 30.26 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 512 tps: 54486.59 qps: 54486.59 (r/w/o: 54486.59/0.00/0.00) lat (ms,95%): 29.72 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 512 tps: 54141.01 qps: 54141.01 (r/w/o: 54141.01/0.00/0.00) lat (ms,95%): 29.19 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 512 tps: 54151.47 qps: 54151.47 (r/w/o: 54151.47/0.00/0.00) lat (ms,95%): 30.26 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 512 tps: 54819.95 qps: 54819.95 (r/w/o: 54819.95/0.00/0.00) lat (ms,95%): 29.19 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 512 tps: 54937.87 qps: 54937.87 (r/w/o: 54937.87/0.00/0.00) lat (ms,95%): 28.67 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 512 tps: 54644.96 qps: 54644.96 (r/w/o: 54644.96/0.00/0.00) lat (ms,95%): 29.19 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 512 tps: 54018.73 qps: 54018.73 (r/w/o: 54018.73/0.00/0.00) lat (ms,95%): 29.72 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 512 tps: 54471.51 qps: 54471.51 (r/w/o: 54471.51/0.00/0.00) lat (ms,95%): 29.72 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 512 tps: 53838.46 qps: 53838.46 (r/w/o: 53838.46/0.00/0.00) lat (ms,95%): 29.72 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 512 tps: 53756.45 qps: 53756.45 (r/w/o: 53756.45/0.00/0.00) lat (ms,95%): 30.26 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 512 tps: 53731.39 qps: 53731.39 (r/w/o: 53731.39/0.00/0.00) lat (ms,95%): 29.72 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 512 tps: 53536.16 qps: 53536.16 (r/w/o: 53536.16/0.00/0.00) lat (ms,95%): 29.72 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 512 tps: 53739.98 qps: 53739.98 (r/w/o: 53739.98/0.00/0.00) lat (ms,95%): 30.26 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 512 tps: 53334.56 qps: 53334.56 (r/w/o: 53334.56/0.00/0.00) lat (ms,95%): 29.72 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 512 tps: 53547.23 qps: 53547.23 (r/w/o: 53547.23/0.00/0.00) lat (ms,95%): 30.26 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 512 tps: 54066.63 qps: 54066.63 (r/w/o: 54066.63/0.00/0.00) lat (ms,95%): 29.72 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 512 tps: 53216.13 qps: 53216.13 (r/w/o: 53216.13/0.00/0.00) lat (ms,95%): 30.26 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            16130634
        write:                           0
        other:                           0
        total:                           16130634
    transactions:                        16130634 (53755.41 per sec.)
    queries:                             16130634 (53755.41 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0719s
    total number of events:              16130634

Latency (ms):
         min:                                  0.41
         avg:                                  9.52
         max:                                135.84
         95th percentile:                     29.72
         sum:                            153599388.08

Threads fairness:
    events (avg/stddev):           31505.1445/147.73
    execution time (avg/stddev):   299.9988/0.02